stress-testing/ultimate.yml
config:
    target: "http://localhost:3001/qa"
    processor: "./data-generator.js"
    phases:
      - duration: 60
        arrivalRate: 5
        name: Warm up
      - duration: 120
        arrivalRate: 5
        rampTo: 50
        name: Ramp up load
      - duration: 600
        arrivalRate: 50
        name: Sustained load
    #payload:
     # path: "keywords.csv"
      #fields:
       # - "keywords"
scenarios:
    - name: "Get questions for a product"
      flow:
        - get:
            url: "/5f8f944c20589457f17fc02c"
        # Pause for 3 seconds:
        - think: 3
        # Mark a question as helpful
        - put:
            url: "/question/5f8f944c20589457f17fc02d/helpful"
        - function: "generateQuestion"
        # add a question
        - post:
            url: "/5f8f944c20589457f17fc02c"
            json:
              body: ""
              name: ""